app/Controllers/Auth.php

INSERT INTO `user` (`username`, `password`, `salt`, `role`) VALUES ('uadmin', '0192023a7bbd73250516f069df18b5006302e765a9c851.49230318', '6302e765a9c851.49230318', 2)
---
    public function valid_register()
    {
        $data = $this->request->getPost();

        $this->validation->run($data, 'register');

        $errors = $this->validation->getErrors();

        if ($errors) {
            session()->setFlashdata('error', $errors);
            return redirect()->to(base_url('/auth/register'));
        }

        $salt = uniqid('', true);

        $password = md5($data['password']) . $salt;

        $this->userModel->save([
            'username' => $data['username'],
            'password' => $password,
            'salt' => $salt,
            'role' => 2
        ]);

SELECT *
FROM `user`
WHERE `username` = 'uadmin'
 LIMIT 1
---
    public function valid_login()
    {
        $data = $this->request->getPost();

        $user = $this->userModel->where('username', $data['username'])->first();